restaurant/ssl/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.ОбработкаЗаказа</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбработкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаявки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбработкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

restaurant/ssl/Documents/ОбработкаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбработкаЗаказа</Name>
			<BasedOn>
				<xr:Item>Document.ФормированиеЗаявки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.РегистрУслуг</xr:Item>
				<xr:Item>AccumulationRegister.Заказы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиРесурсов</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Меню</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Меню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

restaurant/ssl/Catalogs/Рестораны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Рестораны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РестораныПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РежимРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийДень</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОткрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяЗакрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

restaurant/ssl/Documents/Оплата/Ext/ManagerModule.bsl
Процедура ПечатьОплатаЗаказа(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьОплатаЗаказа)
	Макет = Документы.Оплата.ПолучитьМакет("ПечатьОплатаЗаказа");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оплата.Дата КАК ДатаОплаты,
	|	Оплата.Заказ КАК Заказ,
	|	Оплата.Номер КАК Номер,
	|	Оплата.Ресторан КАК Ресторан,
	|	Оплата.СпособОплаты КАК СпособОплаты,
	|	ОбработкаЗаказа.СоставЗаказа.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Меню КАК Меню,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК СоставЗаказа,
	|	ОбработкаЗаказа.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Сумма КАК Сумма,
	|		Сотрудник КАК Сотрудник
	|	) КАК Услуги,
	|	Рестораны.Адрес КАК Адрес,
	|	Рестораны.Телефон КАК Телефон,
	|	Рестораны.Логотип КАК Логотип,
	|	ОбработкаЗаказа.Номер КАК НомерЗаказа,
	|	ОбработкаЗаказа.Дата КАК ДатаЗаказа
	|ИЗ
	|	Документ.Оплата КАК Оплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбработкаЗаказа КАК ОбработкаЗаказа
	|		ПО Оплата.Заказ = ОбработкаЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рестораны КАК Рестораны
	|		ПО Оплата.Ресторан = Рестораны.Ссылка
	|ГДЕ
	|	Оплата.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	ОбластьПодзаголовок = Макет.ПолучитьОбласть("Подзаголовок");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");    
	ОбластьСоставЗаказаШапка = Макет.ПолучитьОбласть("СоставЗаказаШапка");
	ОбластьСоставЗаказа = Макет.ПолучитьОбласть("СоставЗаказа");  
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");   
	ОбластьПечать = Макет.ПолучитьОбласть("Печать");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		// Вывод логотипа
		Если НЕ Выборка.Логотип.Пустая() Тогда
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли;
		
		Номер = Выборка.Номер;
		ДатаОплаты = Выборка.ДатаОплаты; 
		ДатаЗаказа = Выборка.ДатаЗаказа;
		НомерЗаказа = Выборка.НомерЗаказа;   
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.ДатаОплаты = ДатаОплаты;  
		ОбластьЗаголовок.Параметры.ДатаЗаказа = ДатаЗаказа;
		ОбластьЗаголовок.Параметры.НомерЗаказа = НомерЗаказа;    
		ТабДок.Вывести(ОбластьЗаголовок);       
		
		Ресторан = Выборка.Ресторан;
		Адрес = Выборка.Адрес;
		Телефон = Выборка.Телефон;  
		ОбластьПодзаголовок.Параметры.Ресторан = Ресторан;
		ОбластьПодзаголовок.Параметры.Адрес = Адрес;
		ОбластьПодзаголовок.Параметры.Телефон = Телефон;
		ТабДок.Вывести(ОбластьПодзаголовок);
		
		//Результат = Запрос.Выполнить().Выгрузить();
		СуммаИтог = 0;                      
		
		ЕСЛИ НЕ Выборка.Услуги.Пустой() ТОГДА
			ТабДок.Вывести(ОбластьУслугиШапка);
			ВыборкаУслуги = Выборка.Услуги.Выбрать();      
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень()); 
				СуммаИтог = СуммаИтог + ВыборкаУслуги.Сумма;
			КонецЦикла;
		КонецЕсли;     
		
		ТабДок.Вывести(ОбластьРазделитель);
		
		ВыборкаСоставЗаказа = Выборка.СоставЗаказа.Выбрать();
		ЕСЛИ НЕ Выборка.СоставЗаказа.Пустой() Тогда
			ТабДок.Вывести(ОбластьСоставЗаказаШапка);
			Пока ВыборкаСоставЗаказа.Следующий() Цикл
				ОбластьСоставЗаказа.Параметры.Заполнить(ВыборкаСоставЗаказа);
				ТабДок.Вывести(ОбластьСоставЗаказа, ВыборкаСоставЗаказа.Уровень());
				СуммаИтог = СуммаИтог + ВыборкаСоставЗаказа.Сумма;
			КонецЦикла; 
		КонецЕсли;
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ОбластьИтог.Параметры.Ответственный = ТекПользователь;
		ОбластьИтог.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);  
		ТабДок.Вывести(ОбластьИтог);      
		ТабДок.Вывести(ОбластьПечать);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
